In [1]:
import os

In [2]:
path = os.getcwd()

In [3]:
path

'C:\\Users\\gibra\\Desktop\\Data Science\\Portfolio\\SQL\\sqlite3'

# **Library for SQL in Python**

In [4]:
#Import SQL
import sqlite3

In [5]:
# Connect to a database (creates a new database if it doesn't exist)
conn = sqlite3.connect('database.db')

In [6]:
#Create a cursor object to execute SQL statements
cursor = conn.cursor()

# **Retrieve** tables generated on Module 1

In [7]:
# On this module, the tables created on Module 1 will be used: EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS, LOCATIONS

In [8]:
'''  This function reads the sql table stored on our database '''
def read_sql_table(table_name):
    all_query = f"select * from {table_name}"
    attribute_query = f"PRAGMA table_info({table_name})"
    
    #Execute the query that gets the attributes of the columns of table_name
    cursor.execute(attribute_query)
    columns = [[column[1], column[2]] for column in cursor.fetchall()]
    
    #Create empty lists were the values will be stored
    column_headers = []
    column_attributes = []
    
    #Get a list of the column names and attributes
    for column in columns:
        column_headers.append(column[0])
        column_attributes.append(column[1])
    
    # Execute the query to fetch all rows
    cursor.execute(all_query)
    rows = cursor.fetchall()
    
    #Add the column names and column attributes to the table's rows
    rows = [column_headers] + [column_attributes] + ['_' * len(columns)] + rows
    
    # Find the maximum length of each column value
    column_lengths = [len(column) for column in column_headers]
    for row in rows:
        for i, value in enumerate(row):
            column_lengths[i] = max(column_lengths[i], len(str(value)))

    for row in rows:
        print(" | ".join(f"{str(value):<{length}}" for value, length in zip(row, column_lengths)))

In [9]:
read_sql_table('EMPLOYEES')

EMP_ID  | F_NAME      | L_NAME      | SSN     | B_DATE     | SEX  | ADDRESS                      | JOB_ID  | SALARY        | MANAGER_ID | DEP_ID
CHAR(9) | VARCHAR(15) | VARCHAR(15) | CHAR(9) | DATE       | CHAR | VARCHAR(30)                  | CHAR(9) | DECIMAL(10,2) | CHAR(9)    | CHAR(9)
_       | _           | _           | _       | _          | _    | _                            | _       | _             | _          | _
E1001   | John        | Thomas      | 123456  | 1976-01-09 | M    | 5631 Rice, OakPark,IL        | 100     | 100000        | 30001      | 2
E1002   | Alice       | James       | 123457  | 1972-07-31 | F    | 980 Berry ln, Elgin,IL       | 200     | 80000         | 30002      | 5
E1003   | Steve       | Wells       | 123458  | 1980-08-10 | M    | 291 Springs, Gary,IL         | 300     | 50000         | 30002      | 5
E1004   | Santosh     | Kumar       | 123459  | 1985-07-20 | M    | 511 Aurora Av, Aurora,IL     | 400     | 60000         | 30004      | 5
E1005   | Ahmed       | Hussain     | 123410  | 1981-01-04 | M    | 216 Oak Tree, Geneva,IL      | 500     | 70000         | 30001      | 2
E1006   | Nancy       | Allen       | 123411  | 1978-02-06 | F    | 111 Green Pl, Elgin,IL       | 600     | 90000         | 30001      | 2
E1007   | Mary        | Thomas      | 123412  | 1975-05-05 | F    | 100 Rose Pl, Gary,IL         | 650     | 65000         | 30003      | 7
E1008   | Bharath     | Gupta       | 123413  | 1985-05-06 | M    | 145 Berry Ln, Naperville,IL  | 660     | 65000         | 30003      | 7
E1009   | Andrea      | Jones       | 123414  | 1990-07-09 | F    | 120 Fall Creek, Gary,IL      | 234     | 70000         | 30003      | 7
E1010   | Ann         | Jacob       | 123415  | 1982-03-30 | F    | 111 Britany Springs,Elgin,IL | 220     | 70000         | 30004      | 5

In [10]:
read_sql_table('JOB_HISTORY')

EMPL_ID | START_DATE | JOBS_ID | DEPT_ID
CHAR(9) | DATE       | CHAR(9) | CHAR(9)
_       | _          | _       | _
E1001   | 2000-08-01 | 100     | 2
E1002   | 2001-08-01 | 200     | 5
E1003   | 2001-08-16 | 300     | 5
E1004   | 2000-08-16 | 400     | 5
E1005   | 2000-05-30 | 500     | 2
E1006   | 2001-08-16 | 600     | 2
E1007   | 2002-05-30 | 650     | 7
E1008   | 2010-05-06 | 660     | 7
E1009   | 2016-08-16 | 234     | 7
E1010   | 2016-08-16 | 220     | 5

In [11]:
read_sql_table('JOBS')

JOB_IDENT | JOB_TITLE              | MIN_SALARY    | MAX_SALARY
CHAR(9)   | VARCHAR(15)            | DECIMAL(10,2) | DECIMAL(10,2)
_         | _                      | _             | _
100       | Sr. Architect          | 60000         | 100000
200       | Sr. Software Developer | 60000         | 80000
300       | Jr.Software Developer  | 40000         | 60000
400       | Jr.Software Developer  | 40000         | 60000
500       | Jr. Architect          | 50000         | 70000
600       | Lead Architect         | 70000         | 100000
650       | Jr. Designer           | 60000         | 70000
660       | Jr. Designer           | 60000         | 70000
234       | Sr. Designer           | 70000         | 90000
220       | Sr. Designer           | 70000         | 90000

In [12]:
read_sql_table('DEPARTMENTS')

DEPT_ID_DEP | DEP_NAME        | MANAGER_ID | LOC_ID
CHAR(9)     | VARCHAR(15)     | CHAR(9)    | CHAR(9)
_           | _               | _          | _
2           | Architect Group | 30001      | L0001
5           | Software Group  | 30002      | L0002
7           | Design Team     | 30003      | L0003

# JOIN types

## Inner join

In [13]:
'''
* An INNER JOIN returns only the rows from both tables that satisfy the join condition.
* If there is no matching row in the other table, those rows are excluded from the result set.
* The result contains only the rows where the join condition is met. 
'''

'\n* An INNER JOIN returns only the rows from both tables that satisfy the join condition.\n* If there is no matching row in the other table, those rows are excluded from the result set.\n* The result contains only the rows where the join condition is met. \n'

In [14]:
''' We can use inner join to select the names and job start dates of all employees who work for the department number 5. EMPLOYEES will be our left table and JOB_HISTORY our right table'''

inner_join_query = f"SELECT E.F_NAME, E.L_NAME, JH.START_DATE FROM EMPLOYEES AS E INNER JOIN JOB_HISTORY AS JH ON E.EMP_ID = JH.EMPL_ID WHERE DEP_ID = '5';"
cursor.execute(inner_join_query)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

Alice	James	2001-08-01
Steve	Wells	2001-08-16
Santosh	Kumar	2000-08-16
Ann	Jacob	2016-08-16

In [15]:
''' We can use inner join to select the names, job start dates, and job titles of all employees who work for the department number 5. This requires an inner join with 3 tables'''

inner_join_query = f"SELECT E.F_NAME, E.L_NAME, J.JOB_TITLE, JH.START_DATE FROM EMPLOYEES AS E INNER JOIN JOBS AS J ON E.JOB_ID = J.JOB_IDENT INNER JOIN JOB_HISTORY AS JH ON E.EMP_ID = JH.EMPL_ID WHERE DEP_ID = '5';"
cursor.execute(inner_join_query)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

Alice	James	Sr. Software Developer	2001-08-01
Steve	Wells	Jr.Software Developer	2001-08-16
Santosh	Kumar	Jr.Software Developer	2000-08-16
Ann	Jacob	Sr. Designer	2016-08-16

## Left Outer Join

In [16]:
'''
* A LEFT OUTER JOIN returns all rows from the left table (the table specified before the JOIN keyword) and the matching rows from the right table.
* If there is no matching row in the right table, NULL values are included for columns from the right table.
* The result includes all rows from the left table, even if there are no matches in the right table.
'''

'\n* A LEFT OUTER JOIN returns all rows from the left table (the table specified before the JOIN keyword) and the matching rows from the right table.\n* If there is no matching row in the right table, NULL values are included for columns from the right table.\n* The result includes all rows from the left table, even if there are no matches in the right table.\n'

In [17]:
''' We can use left outer join on the EMPLOYEES and DEPARTMENT tables to select employee id, last name, department id and department name for all employees. 
EMPLOYEES will be our left table and DEPARTMETNS our right table'''

left_outer_join_query = f"SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME FROM EMPLOYEES E LEFT OUTER JOIN DEPARTMENTS D ON E.DEP_ID = D.DEPT_ID_DEP ;"
cursor.execute(left_outer_join_query)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

E1001	Thomas	2	Architect Group
E1002	James	5	Software Group
E1003	Wells	5	Software Group
E1004	Kumar	5	Software Group
E1005	Hussain	2	Architect Group
E1006	Allen	2	Architect Group
E1007	Thomas	7	Design Team
E1008	Gupta	7	Design Team
E1009	Jones	7	Design Team
E1010	Jacob	5	Software Group

In [18]:
''' Same as before, but limiting our results to employees born before 1980'''

left_outer_join_query_1980 = f"SELECT E.EMP_ID, E.L_NAME, E.B_DATE, E.DEP_ID, D.DEP_NAME FROM EMPLOYEES E LEFT OUTER JOIN DEPARTMENTS D ON E.DEP_ID = D.DEPT_ID_DEP WHERE strftime('%Y', E.B_DATE) < '1980';"
cursor.execute(left_outer_join_query_1980)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

E1001	Thomas	1976-01-09	2	Architect Group
E1002	James	1972-07-31	5	Software Group
E1006	Allen	1978-02-06	2	Architect Group
E1007	Thomas	1975-05-05	7	Design Team

In [19]:
''' We can use LEFT OUTER JOIN on the EMPLOYEES and DEPARTMENT tables to select employee id, last name, but to show only department id and department name for the employees born 
before 1980 (join with a condition on the right table). 
EMPLOYEES will be our left table and DEPARTMETNS our right table'''

inner_join_and = f"SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME FROM EMPLOYEES E LEFT OUTER JOIN DEPARTMENTS D ON E.DEP_ID = D.DEPT_ID_DEP AND strftime('%Y', E.B_DATE) < '1980';"
cursor.execute(inner_join_and)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

E1001	Thomas	2	Architect Group
E1002	James	5	Software Group
E1003	Wells	5	None
E1004	Kumar	5	None
E1005	Hussain	2	None
E1006	Allen	2	Architect Group
E1007	Thomas	7	Design Team
E1008	Gupta	7	None
E1009	Jones	7	None
E1010	Jacob	5	None

## Full outer join

In [20]:
'''
* A FULL OUTER JOIN returns all rows from BOTH tables regardless of whether there is a match between the tables or not.
* If there is no matching row in one table, NULL values are included for columns from the other table.
* The result includes all rows from BOTH tables, even if there are no matches in one of the other tables.
'''

'\n* A FULL OUTER JOIN returns all rows from BOTH tables regardless of whether there is a match between the tables or not.\n* If there is no matching row in one table, NULL values are included for columns from the other table.\n* The result includes all rows from BOTH tables, even if there are no matches in one of the other tables.\n'

In [21]:
''' We can use a full outer join on the EMPLOYEES and DEPARTMENT tables to select the First Name, Last Name and Department name of all employees'''

full_outer_join_query = f"SELECT E.F_NAME, E.L_NAME, D.DEP_NAME FROM EMPLOYEES E FULL OUTER JOIN DEPARTMENTS D ON E.DEP_ID = D.DEPT_ID_DEP ;"
cursor.execute(full_outer_join_query)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

John	Thomas	Architect Group
Alice	James	Software Group
Steve	Wells	Software Group
Santosh	Kumar	Software Group
Ahmed	Hussain	Architect Group
Nancy	Allen	Architect Group
Mary	Thomas	Design Team
Bharath	Gupta	Design Team
Andrea	Jones	Design Team
Ann	Jacob	Software Group

In [22]:
''' We can use a full outer join on the EMPLOYEES and DEPARTMENT tables to select all the employee names, but only department ID and deparment Names for male employees'''

full_outer_join_and_query = f"SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME FROM EMPLOYEES E FULL OUTER JOIN DEPARTMENTS D ON E.DEP_ID = D.DEPT_ID_DEP AND E.SEX = 'M';"
cursor.execute(full_outer_join_and_query)
rows = cursor.fetchall()

# Extract and print the SQL statement
for row in rows:
    print("\t".join(map(str,row)))

John	Thomas	2	Architect Group
Alice	James	None	None
Steve	Wells	5	Software Group
Santosh	Kumar	5	Software Group
Ahmed	Hussain	2	Architect Group
Nancy	Allen	None	None
Mary	Thomas	None	None
Bharath	Gupta	7	Design Team
Andrea	Jones	None	None
Ann	Jacob	None	None

In [23]:
conn.commit()
conn.close()